app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        DB::beginTransaction();
        try {
            $user = User::create([
                'name' => $request->name,
                'email' => $request->email,
                'password' => Hash::make($request->password),
            ]);

            event(new Registered($user));

            $customer = new Customer();
            $names = explode(" ", $user->name);
            $customer->user_id = $user->id;
            $customer->first_name = $names[0];
            $customer->last_name = $names[1] ?? '';
            $customer->save();
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Rahul Jain', 'rahuljain@yopmail.com', '$2y$10$WBk29kdf3KZd9KVovek3/.brKsCH0YFe8A5CwfB09E2DlLNUM3vue', '2024-04-21 15:46:02', '2024-04-21 15:46:02')
insert into `customers` (`user_id`, `first_name`, `last_name`, `updated_at`, `created_at`) values (32, 'Rahul', 'Jain', '2024-04-21 15:46:10', '2024-04-21 15:46:10')