app/Http/Controllers/Api/CustomerController.php

select * from `customers` order by `customers`.`updated_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (26, 27, 28, 29)
select count(*) as aggregate from `customers`
---
    public function index()
    {

        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');
        $query = Customer::query()
            ->with('user')
            ->orderBy("customers.$sortField", $sortDirection);

        if ($search) {
            $query
                ->where(DB::raw("CONCAT(first_name, ' ', last_name)"), 'like', "%{$search}%")
                ->join('users', 'customers.user_id', '=', 'users.id')
                ->orWhere('users.email', 'like', "%{$search}%")
                ->orWhere('customers.phone', 'like', "%{$search}%");
        }

        $paginator = $query->paginate($perPage);

select * from `countries` order by `name` asc
---
    public function countries()
    {
        return CountryResource::collection(Country::query()->orderBy('name', 'asc')->get());