app/Http/Controllers/Api/ProductController.php

    public function index()
    {
        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'created_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Product::query()
            ->where('title', 'like', "%{$search}%")
            ->orderBy($sortField, $sortDirection)
            ->paginate($perPage);
---
select * from `products` where `title` like '%%' and `products`.`deleted_at` is null order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `title` like '%%' and `products`.`deleted_at` is null

    public function store(ProductRequest $request)
    {
        $data = $request->validated();
        $data['created_by'] = $request->user()->id;
        $data['updated_by'] = $request->user()->id;

        /** @var \Illuminate\Http\UploadedFile[] $images */
        $images = $data['images'] ?? [];
        $imagePositions = $data['image_positions'] ?? [];
        $categories = $data['categories'] ?? [];

        $product = Product::create($data);
---
insert into `products` (`title`, `price`, `description`, `published`, `created_by`, `updated_by`, `slug`, `updated_at`, `created_at`) values ('OnePlus Nord CE 3 Lite 5G (Pastel Lime, 8GB RAM, 128GB Storage)', '17999', '<ul><li>Camera: 108 MP Main Camera with EIS; 2MP Depth-Assist Lens and 2MP Macro Lens; Front (Selfie) Camera: 16MP</li><li>Rear Camera Mode: Hi-res 108MP mode, 3x Lossles Zoom, Photo, Video, Nightscape, Expert, Panoramic, Portrait, Macro, Time-lapse, Slow-motion, Long exposure, Dual-view video, Text Scanner, 1080p/720p@30fps, Video zoom: 1080P@30fps, 720P@30fps, Slow motion: 720P@120fps, Time-Lapse: 1080P@30fps, Steady Video EIS support</li><li>Display: 6.72 Inches; 120 Hz Adaptive refresh rate; FHD+(1080×2400), Colors: 16.7 Million colors, 391 ppi, Aspect Ratio: 20:9, Brightness: 550 nits (typical), 680 nits (HBM)</li><li>Operating System: Oxygen OS based on Android 13.1</li><li>Processor: Qualcomm Snapdragon 695 5G</li><li>Battery &amp; Charging: 5000 mAh with 67W SUPERVOOC Endurance Edition</li></ul>', '1', 1, 1, 'oneplus-nord-ce-3-lite-5g-pastel-lime-8gb-ram-128gb-storage', '2024-03-10 11:26:31', '2024-03-10 11:26:31')

    private function saveCategories($categoryIds, Product $product)
    {
        ProductCategory::where('product_id', $product->id)->delete();
---
delete from `product_categories` where `product_id` = 8

    private function saveImages($images, $positions, Product $product)
    {
        foreach ($positions as $id => $position) {
            ProductImage::query()
                ->where('id', $id)
                ->update(['position' => $position]);
        }

        foreach ($images as $id => $image) {
            $path = 'images/' . Str::random();
            if (!Storage::exists($path)) {
                Storage::makeDirectory($path, 0755, true);
            }
            $name = Str::random().'.'.$image->getClientOriginalExtension();
            if (!Storage::putFileAS('app/public/' . $path, $image, $name)) {
                throw new \Exception("Unable to save file \"{$image->getClientOriginalName()}\"");
            }
            $relativePath = $path . '/' . $name;

            ProductImage::create([
                'product_id' => $product->id,
                'path' => $relativePath,
                'url' => URL::to(Storage::url($relativePath)),
                'mime' => $image->getClientMimeType(),
                'size' => $image->getSize(),
                'position' => $positions[$id] ?? $id + 1
            ]);
---
insert into `product_images` (`product_id`, `path`, `url`, `mime`, `size`, `position`, `updated_at`, `created_at`) values (8, 'images/yX56FHPVQsnv9NIR/bWKckHxLLeJH9ATV.jpg', 'http://127.0.0.1:8000/storage/images/yX56FHPVQsnv9NIR/bWKckHxLLeJH9ATV.jpg', 'image/jpeg', 176507, 1, '2024-03-10 11:26:32', '2024-03-10 11:26:32')