app/Http/Controllers/ProductController.php

    private function renderProducts(Builder $query)
    {
        $search = \request()->get('search');
        $sort = \request()->get('sort', '-updated_at');

        if ($sort) {
            $sortDirection = 'asc';
            if ($sort[0] === '-') {
                $sortDirection = 'desc';
            }
            $sortField = preg_replace('/^-?/', '', $sort);

            $query->orderBy($sortField, $sortDirection);
        }
        $products = $query
            ->where('published', '=', 1)
            ->where(function ($query) use ($search) {
                /** @var $query \Illuminate\Database\Eloquent\Builder */
                $query->where('products.title', 'like', "%$search%")
                    ->orWhere('products.description', 'like', "%$search%");
            })

            ->paginate(5);
---
select * from `products` where `published` = 1 and (`products`.`title` like '%%' or `products`.`description` like '%%') and `products`.`deleted_at` is null order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `products` where `published` = 1 and (`products`.`title` like '%%' or `products`.`description` like '%%') and `products`.`deleted_at` is null